1password
arc
Discord
docker
figma
flux
font-hack-nerd-font
font-jetbrains-mono
font-jetbrains-mono-nerd-font
geekbench
notion
raycast
slack
spotify
visual-studio-code@insiders
zen
tailscale
windsurf
cursor
lm-studio
ollama
leapp
session-manager-plugin
warp@preview