1password
1password-cli
arc
discord
docker-desktop
cursor
figma
flux
font-hack-nerd-font
font-jetbrains-mono
font-jetbrains-mono-nerd-font
font-zed-mono-nerd-font
geekbench
raycast
slack
spotify
visual-studio-code@insiders
zed
google-chrome@dev
kitty
zen
tailscale-app
windsurf
cursor
lm-studio
leapp
logi-options+
session-manager-plugin
warp
