1password
arc
Discord
docker
figma
flux
font-hack-nerd-font
font-jetbrains-mono
font-jetbrains-mono-nerd-font
jordanbaird-ice
applite
loop
geekbench
lm-studio
notion
raycast
slack
spotify
vscodium
visual-studio-code@insiders
zen-browser@twilight
tailscale
windsurf
session-manager-plugin